/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cblanca <cblanca@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/06 17:08:05 by cblanca           #+#    #+#             */
/*   Updated: 2021/10/15 14:38:13 by cblanca          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/* превращает в 0 первые n байт во входящей строке
экономим строки кода и отправляем в мемсет */

void	ft_bzero(void *s, size_t n)
{
	ft_memset(s, 0, n);
}
